request.xml

<!--soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://opentable.com/htng/otsquad">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getMemberSquads>
         <gs:memberName>jasson</gs:memberName>
      </gs:getMemberSquads>
   </soapenv:Body>
</soapenv:Envelope-->

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://opentable.com/htng/otsquad">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getOTSquad>
         <gs:squadName>PUPS</gs:squadName>
      </gs:getOTSquad>
   </soapenv:Body>
</soapenv:Envelope>

        <!--soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                          xmlns:gs="http://opentable.com/htng/otsquad">
           <soapenv:Header/>
           <soapenv:Body>
              <gs:addMemberToSquad>
                 <gs:squadName>PUPS</gs:squadName>
                 <gs:memberName>DMITRY</gs:memberName>
              </gs:addMemberToSquad>
           </soapenv:Body>
        </soapenv:Envelope-->